src/Python/Python Things.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: Python Things
#+OPTIONS: num:nil H:2

* parse argument
http://docs.python.org/2/library/argparse.html
#+begin_src python
import argparse

parser = argparse.ArgumentParser(description='Process some integers.')
parser.add_argument('integers', metavar='N', type=int, nargs='+',
                   help='an integer for the accumulator')
parser.add_argument('--sum', dest='accumulate', action='store_const',
                   const=sum, default=max,
                   help='sum the integers (default: find the max)')

args = parser.parse_args()
print args.accumulate(args.integers)
#+end_src

#+begin_src sh
$ prog.py 1 2 3 4
4

$ prog.py 1 2 3 4 --sum
10
#+end_src
* Configuration file parser
http://docs.python.org/2/library/configparser.html

* pySerial
#+begin_src sh
sudo apt-get install python-pip
pip install mechanize
pip install pyserial
#+end_src

http://pyserial.sourceforge.net/pyserial.html#installation

* IDE
** Eclipse+Pydev+PyLint
*** PyLint can be used with PyDev
http://pydev.org/manual_adv_pylint.html

* python Ping
