src/Python/Python Things.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Python Things</title>
<!-- 2014-01-01 Wed 16:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Python Things</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">parse argument</a></li>
<li><a href="#sec-2">Configuration file parser</a></li>
<li><a href="#sec-3">pySerial</a></li>
<li><a href="#sec-4">IDE</a>
<ul>
<li><a href="#sec-4-1">Eclipse+Pydev+PyLint</a></li>
</ul>
</li>
<li><a href="#sec-5">python Ping</a>
<ul>
<li><a href="#sec-5-1">A pure python ping implementation using raw socket.</a></li>
<li><a href="#sec-5-2">ping and traceroute</a></li>
<li><a href="#sec-5-3">A pure python ICMP ping implementation using raw sockets.</a></li>
<li><a href="#sec-5-4">Lars Strand's ping</a></li>
</ul>
</li>
<li><a href="#sec-6">Python "pseudo-inplace" file contents</a></li>
<li><a href="#sec-7">Python send simple Email</a></li>
<li><a href="#sec-8">compare "version-style" strings</a></li>
<li><a href="#sec-9">windows install pip</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">parse argument</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://docs.python.org/2/library/argparse.html">http://docs.python.org/2/library/argparse.html</a>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">import</span> argparse

<span style="color: #ffebcd; background-color: #2f4f4f;">parser</span> = argparse.ArgumentParser(<span style="color: #ffebcd; background-color: #2f4f4f;">description</span>=<span style="color: #ffa07a;">'Process some integers.'</span>)
parser.add_argument(<span style="color: #ffa07a;">'integers'</span>, <span style="color: #ffebcd; background-color: #2f4f4f;">metavar</span>=<span style="color: #ffa07a;">'N'</span>, <span style="color: #ffebcd; background-color: #2f4f4f;">type</span>=int, <span style="color: #ffebcd; background-color: #2f4f4f;">nargs</span>=<span style="color: #ffa07a;">'+'</span>,
                   <span style="color: #ffebcd; background-color: #2f4f4f;">help</span>=<span style="color: #ffa07a;">'an integer for the accumulator'</span>)
parser.add_argument(<span style="color: #ffa07a;">'--sum'</span>, <span style="color: #ffebcd; background-color: #2f4f4f;">dest</span>=<span style="color: #ffa07a;">'accumulate'</span>, <span style="color: #ffebcd; background-color: #2f4f4f;">action</span>=<span style="color: #ffa07a;">'store_const'</span>,
                   <span style="color: #ffebcd; background-color: #2f4f4f;">const</span>=sum, <span style="color: #ffebcd; background-color: #2f4f4f;">default</span>=max,
                   <span style="color: #ffebcd; background-color: #2f4f4f;">help</span>=<span style="color: #ffa07a;">'sum the integers (default: find the max)'</span>)

<span style="color: #ffebcd; background-color: #2f4f4f;">args</span> = parser.parse_args()
<span style="color: #b0c4de;">print</span> args.accumulate(args.integers)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">$ prog.py 1 2 3 4
4

$ prog.py 1 2 3 4 --sum
10
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Configuration file parser</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://docs.python.org/2/library/configparser.html">http://docs.python.org/2/library/configparser.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">pySerial</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install python-pip
pip install mechanize
pip install pyserial
</pre>
</div>

<p>
<a href="http://pyserial.sourceforge.net/pyserial.html#installation">http://pyserial.sourceforge.net/pyserial.html#installation</a>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">IDE</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Eclipse+Pydev+PyLint</h3>
<div class="outline-text-3" id="text-4-1">
</div><ul class="org-ul"><li>PyLint can be used with PyDev<br  /><div class="outline-text-4" id="text-4-1-1">
<p>
<a href="http://pydev.org/manual_adv_pylint.html">http://pydev.org/manual_adv_pylint.html</a>
</p>
</div>
</li></ul>
</div>
</div>
