src/Python/Python Things.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">python Ping</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">A pure python ping implementation using raw socket.</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="http://www.g-loaded.eu/2009/10/30/python-ping/">http://www.g-loaded.eu/2009/10/30/python-ping/</a>
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/usr/bin/env python</span>
<span style="color: #ffa07a;">"""</span>
<span style="color: #ffa07a;">    A pure python ping implementation using raw socket.</span>


<span style="color: #ffa07a;">    Note that ICMP messages can only be sent from processes running as root.</span>


<span style="color: #ffa07a;">    Derived from ping.c distributed in Linux's netkit. That code is</span>
<span style="color: #ffa07a;">    copyright (c) 1989 by The Regents of the University of California.</span>
<span style="color: #ffa07a;">    That code is in turn derived from code written by Mike Muuss of the</span>
<span style="color: #ffa07a;">    US Army Ballistic Research Laboratory in December, 1983 and</span>
<span style="color: #ffa07a;">    placed in the public domain. They have my thanks.</span>

<span style="color: #ffa07a;">    Bugs are naturally mine. I'd be glad to hear about them. There are</span>
<span style="color: #ffa07a;">    certainly word - size dependenceies here.</span>

<span style="color: #ffa07a;">    Copyright (c) Matthew Dixon Cowles, &lt;<a href="http://www.visi.com/~mdc/">http://www.visi.com/~mdc/</a>&gt;.</span>
<span style="color: #ffa07a;">    Distributable under the terms of the GNU General Public License</span>
<span style="color: #ffa07a;">    version 2. Provided with no warranties of any sort.</span>

<span style="color: #ffa07a;">    Original Version from Matthew Dixon Cowles:</span>
<span style="color: #ffa07a;">      -&gt; ftp://ftp.visi.com/users/mdc/ping.py</span>

<span style="color: #ffa07a;">    Rewrite by Jens Diemer:</span>
<span style="color: #ffa07a;">      -&gt; http://www.python-forum.de/post-69122.html#69122</span>

<span style="color: #ffa07a;">    Rewrite by George Notaras:</span>
<span style="color: #ffa07a;">      -&gt; http://www.g-loaded.eu/2009/10/30/python-ping/</span>

<span style="color: #ffa07a;">    Revision history</span>
<span style="color: #ffa07a;">    ~~~~~~~~~~~~~~~~</span>

<span style="color: #ffa07a;">    November 8, 2009</span>
<span style="color: #ffa07a;">    ----------------</span>
<span style="color: #ffa07a;">    Improved compatibility with GNU/Linux systems.</span>

<span style="color: #ffa07a;">    Fixes by:</span>
<span style="color: #ffa07a;">     * George Notaras -- http://www.g-loaded.eu</span>
<span style="color: #ffa07a;">    Reported by:</span>
<span style="color: #ffa07a;">     * Chris Hallman -- http://cdhallman.blogspot.com</span>

<span style="color: #ffa07a;">    Changes in this release:</span>
<span style="color: #ffa07a;">     - Re-use time.time() instead of time.clock(). The 2007 implementation</span>
<span style="color: #ffa07a;">       worked only under Microsoft Windows. Failed on GNU/Linux.</span>
<span style="color: #ffa07a;">       time.clock() behaves differently under the two OSes[1].</span>

<span style="color: #ffa07a;">    [1] http://docs.python.org/library/time.html#time.clock</span>

<span style="color: #ffa07a;">    May 30, 2007</span>
<span style="color: #ffa07a;">    ------------</span>
<span style="color: #ffa07a;">    little rewrite by Jens Diemer:</span>
<span style="color: #ffa07a;">     -  change socket asterisk import to a normal import</span>
<span style="color: #ffa07a;">     -  replace time.time() with time.clock()</span>
<span style="color: #ffa07a;">     -  delete "return None" (or change to "return" only)</span>
<span style="color: #ffa07a;">     -  in checksum() rename "str" to "source_string"</span>

<span style="color: #ffa07a;">    November 22, 1997</span>
<span style="color: #ffa07a;">    -----------------</span>
<span style="color: #ffa07a;">    Initial hack. Doesn't do much, but rather than try to guess</span>
<span style="color: #ffa07a;">    what features I (or others) will want in the future, I've only</span>
<span style="color: #ffa07a;">    put in what I need now.</span>

<span style="color: #ffa07a;">    December 16, 1997</span>
<span style="color: #ffa07a;">    -----------------</span>
<span style="color: #ffa07a;">    For some reason, the checksum bytes are in the wrong order when</span>
<span style="color: #ffa07a;">    this is run under Solaris 2.X for SPARC but it works right under</span>
<span style="color: #ffa07a;">    Linux x86. Since I don't know just what's wrong, I'll swap the</span>
<span style="color: #ffa07a;">    bytes always and then do an htons().</span>

<span style="color: #ffa07a;">    December 4, 2000</span>
<span style="color: #ffa07a;">    ----------------</span>
<span style="color: #ffa07a;">    Changed the struct.pack() calls to pack the checksum and ID as</span>
<span style="color: #ffa07a;">    unsigned. My thanks to Jerome Poincheval for the fix.</span>


<span style="color: #ffa07a;">    Last commit info:</span>
<span style="color: #ffa07a;">    ~~~~~~~~~~~~~~~~~</span>
<span style="color: #ffa07a;">    $LastChangedDate: $</span>
<span style="color: #ffa07a;">    $Rev: $</span>
<span style="color: #ffa07a;">    $Author: $</span>
<span style="color: #ffa07a;">"""</span>


<span style="color: #00ffff;">import</span> os, sys, socket, struct, select, time

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">From /usr/include/linux/icmp.h; your milage may vary.</span>
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_ECHO_REQUEST</span> = 8 <span style="color: #ff7f24;"># Seems to be the same on Solaris.</span>


<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">checksum</span>(source_string):
    <span style="color: #ffa07a;">"""</span>
<span style="color: #ffa07a;">    I'm not too confident that this is right but testing seems</span>
<span style="color: #ffa07a;">    to suggest that it gives the same answers as in_cksum in ping.c</span>
<span style="color: #ffa07a;">    """</span>
    <span style="color: #b0c4de;">sum</span> = 0
    <span style="color: #ffebcd; background-color: #2f4f4f;">countTo</span> = (<span style="color: #b0c4de;">len</span>(source_string)/2)*2
    <span style="color: #ffebcd; background-color: #2f4f4f;">count</span> = 0
    <span style="color: #00ffff;">while</span> count&lt;countTo:
        <span style="color: #ffebcd; background-color: #2f4f4f;">thisVal</span> = <span style="color: #b0c4de;">ord</span>(source_string[count + 1])*256 + <span style="color: #b0c4de;">ord</span>(source_string[count])
        <span style="color: #b0c4de;">sum</span> = <span style="color: #b0c4de;">sum</span> + thisVal
        <span style="color: #b0c4de;">sum</span> = <span style="color: #b0c4de;">sum</span> &amp; 0xffffffff <span style="color: #ff7f24;"># Necessary?</span>
        <span style="color: #ffebcd; background-color: #2f4f4f;">count</span> = count + 2

    <span style="color: #00ffff;">if</span> countTo&lt;<span style="color: #b0c4de;">len</span>(source_string):
        <span style="color: #b0c4de;">sum</span> = <span style="color: #b0c4de;">sum</span> + <span style="color: #b0c4de;">ord</span>(source_string[<span style="color: #b0c4de;">len</span>(source_string) - 1])
        <span style="color: #b0c4de;">sum</span> = <span style="color: #b0c4de;">sum</span> &amp; 0xffffffff <span style="color: #ff7f24;"># Necessary?</span>

    <span style="color: #b0c4de;">sum</span> = (<span style="color: #b0c4de;">sum</span> &gt;&gt; 16)  +  (<span style="color: #b0c4de;">sum</span> &amp; 0xffff)
    <span style="color: #b0c4de;">sum</span> = <span style="color: #b0c4de;">sum</span> + (<span style="color: #b0c4de;">sum</span> &gt;&gt; 16)
    <span style="color: #ffebcd; background-color: #2f4f4f;">answer</span> = ~<span style="color: #b0c4de;">sum</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">answer</span> = answer &amp; 0xffff

    <span style="color: #ff7f24;"># Swap bytes. Bugger me if I know why.</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">answer</span> = answer &gt;&gt; 8 | (answer &lt;&lt; 8 &amp; 0xff00)

    <span style="color: #00ffff;">return</span> answer


<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">receive_one_ping</span>(my_socket, ID, timeout):
    <span style="color: #ffa07a;">"""</span>
<span style="color: #ffa07a;">    receive the ping from the socket.</span>
<span style="color: #ffa07a;">    """</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">timeLeft</span> = timeout
    <span style="color: #00ffff;">while</span> <span style="color: #00ffff;">True</span>:
        <span style="color: #ffebcd; background-color: #2f4f4f;">startedSelect</span> = time.time()
        <span style="color: #ffebcd; background-color: #2f4f4f;">whatReady</span> = select.select([my_socket], [], [], timeLeft)
        <span style="color: #ffebcd; background-color: #2f4f4f;">howLongInSelect</span> = (time.time() - startedSelect)
        <span style="color: #00ffff;">if</span> whatReady[0] == []: <span style="color: #ff7f24;"># Timeout</span>
            <span style="color: #00ffff;">return</span>

        <span style="color: #ffebcd; background-color: #2f4f4f;">timeReceived</span> = time.time()
        recPacket, <span style="color: #ffebcd; background-color: #2f4f4f;">addr</span> = my_socket.recvfrom(1024)
        <span style="color: #ffebcd; background-color: #2f4f4f;">icmpHeader</span> = recPacket[20:28]
        type, code, checksum, packetID, <span style="color: #ffebcd; background-color: #2f4f4f;">sequence</span> = struct.unpack(
            <span style="color: #ffa07a;">"bbHHh"</span>, icmpHeader
        )
        <span style="color: #00ffff;">if</span> packetID == ID:
            <span style="color: #ffebcd; background-color: #2f4f4f;">bytesInDouble</span> = struct.calcsize(<span style="color: #ffa07a;">"d"</span>)
            <span style="color: #ffebcd; background-color: #2f4f4f;">timeSent</span> = struct.unpack(<span style="color: #ffa07a;">"d"</span>, recPacket[28:28 + bytesInDouble])[0]
            <span style="color: #00ffff;">return</span> timeReceived - timeSent

        <span style="color: #ffebcd; background-color: #2f4f4f;">timeLeft</span> = timeLeft - howLongInSelect
        <span style="color: #00ffff;">if</span> timeLeft &lt;= 0:
            <span style="color: #00ffff;">return</span>


<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">send_one_ping</span>(my_socket, dest_addr, ID):
    <span style="color: #ffa07a;">"""</span>
<span style="color: #ffa07a;">    Send one ping to the given &gt;dest_addr&lt;.</span>
<span style="color: #ffa07a;">    """</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">dest_addr</span>  =  socket.gethostbyname(dest_addr)

    <span style="color: #ff7f24;"># Header is type (8), code (8), checksum (16), id (16), sequence (16)</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">my_checksum</span> = 0

    <span style="color: #ff7f24;"># Make a dummy heder with a 0 checksum.</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">header</span> = struct.pack(<span style="color: #ffa07a;">"bbHHh"</span>, ICMP_ECHO_REQUEST, 0, my_checksum, ID, 1)
    <span style="color: #ffebcd; background-color: #2f4f4f;">bytesInDouble</span> = struct.calcsize(<span style="color: #ffa07a;">"d"</span>)
    <span style="color: #ffebcd; background-color: #2f4f4f;">data</span> = (192 - bytesInDouble) * <span style="color: #ffa07a;">"Q"</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">data</span> = struct.pack(<span style="color: #ffa07a;">"d"</span>, time.time()) + data

    <span style="color: #ff7f24;"># Calculate the checksum on the data and the dummy header.</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">my_checksum</span> = checksum(header + data)

    <span style="color: #ff7f24;"># Now that we have the right checksum, we put that in. It's just easier</span>
    <span style="color: #ff7f24;"># to make up a new header than to stuff it into the dummy.</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">header</span> = struct.pack(
        <span style="color: #ffa07a;">"bbHHh"</span>, ICMP_ECHO_REQUEST, 0, socket.htons(my_checksum), ID, 1
    )
    <span style="color: #ffebcd; background-color: #2f4f4f;">packet</span> = header + data
    my_socket.sendto(packet, (dest_addr, 1)) <span style="color: #ff7f24;"># Don't know about the 1</span>


<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">do_one</span>(dest_addr, timeout):
    <span style="color: #ffa07a;">"""</span>
<span style="color: #ffa07a;">    Returns either the delay (in seconds) or none on timeout.</span>
<span style="color: #ffa07a;">    """</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">icmp</span> = socket.getprotobyname(<span style="color: #ffa07a;">"icmp"</span>)
    <span style="color: #00ffff;">try:</span>
        <span style="color: #ffebcd; background-color: #2f4f4f;">my_socket</span> = socket.socket(socket.AF_INET, socket.SOCK_RAW, icmp)
    <span style="color: #00ffff;">except</span> <span style="color: #b0c4de;">socket.error</span>, (errno, msg):
        <span style="color: #00ffff;">if</span> errno == 1:
            <span style="color: #ff7f24;"># Operation not permitted</span>
            <span style="color: #ffebcd; background-color: #2f4f4f;">msg</span> = msg + (
                <span style="color: #ffa07a;">" - Note that ICMP messages can only be sent from processes"</span>
                <span style="color: #ffa07a;">" running as root."</span>
            )
            <span style="color: #00ffff;">raise</span> <span style="color: #b0c4de;">socket.error</span>(msg)
        <span style="color: #00ffff;">raise</span> <span style="color: #ff7f24;"># raise the original error</span>

    <span style="color: #ffebcd; background-color: #2f4f4f;">my_ID</span> = os.getpid() &amp; 0xFFFF

    send_one_ping(my_socket, dest_addr, my_ID)
    <span style="color: #ffebcd; background-color: #2f4f4f;">delay</span> = receive_one_ping(my_socket, my_ID, timeout)

    my_socket.close()
    <span style="color: #00ffff;">return</span> delay


<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">verbose_ping</span>(dest_addr, <span style="color: #ffebcd; background-color: #2f4f4f;">timeout</span> = 2, <span style="color: #ffebcd; background-color: #2f4f4f;">count</span> = 4):
    <span style="color: #ffa07a;">"""</span>
<span style="color: #ffa07a;">    Send &gt;count&lt; ping to &gt;dest_addr&lt; with the given &gt;timeout&lt; and display</span>
<span style="color: #ffa07a;">    the result.</span>
<span style="color: #ffa07a;">    """</span>
    <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(count):
        <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"ping %s..."</span> % dest_addr,
        <span style="color: #00ffff;">try:</span>
            <span style="color: #ffebcd; background-color: #2f4f4f;">delay</span>  =  do_one(dest_addr, timeout)
        <span style="color: #00ffff;">except</span> <span style="color: #b0c4de;">socket.gaierror</span>, e:
            <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"failed. (socket error: '%s')"</span> % e[1]
            <span style="color: #00ffff;">break</span>

        <span style="color: #00ffff;">if</span> delay  ==  <span style="color: #00ffff;">None</span>:
            <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"failed. (timeout within %ssec.)"</span> % timeout
        <span style="color: #00ffff;">else:</span>
            <span style="color: #ffebcd; background-color: #2f4f4f;">delay</span>  =  delay * 1000
            <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"get ping in %0.4fms"</span> % delay
    <span style="color: #b0c4de;">print</span>


<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">'__main__'</span>:
    verbose_ping(<span style="color: #ffa07a;">"heise.de"</span>)
    verbose_ping(<span style="color: #ffa07a;">"google.com"</span>)
    verbose_ping(<span style="color: #ffa07a;">"a-test-url-taht-is-not-available.com"</span>)
    verbose_ping(<span style="color: #ffa07a;">"192.168.1.1"</span>)
</pre>
</div>
</div>
</div>
