src/Python/Python Things.org
** ping and traceroute
http://www.python.org/~jeremy/python.html

ping.tar.gz

Some simple-minded code for manipulating raw IP, ICMP, and UDP
packets. They allow you to write ping and traceroute completely in
Python; the code is smaller and simpler than the corresponding C
versions (e.g. [[http://www.opensource.apple.com/source/network_cmds/network_cmds-307.0.1/traceroute.tproj/traceroute.c][traceroute.c]]). The code was written for Python 1.4; it
should be updated to use the new features of the struct module in 1.5.

** A pure python ICMP ping implementation using raw sockets.
https://github.com/shishougang/python_ping
