src/Python/Python Things.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">ping and traceroute</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="http://www.python.org/~jeremy/python.html">http://www.python.org/~jeremy/python.html</a>
</p>

<p>
ping.tar.gz
</p>

<p>
Some simple-minded code for manipulating raw IP, ICMP, and UDP
packets. They allow you to write ping and traceroute completely in
Python; the code is smaller and simpler than the corresponding C
versions (e.g. <a href="http://www.opensource.apple.com/source/network_cmds/network_cmds-307.0.1/traceroute.tproj/traceroute.c">traceroute.c</a>). The code was written for Python 1.4; it
should be updated to use the new features of the struct module in 1.5.
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">A pure python ICMP ping implementation using raw sockets.</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<a href="https://github.com/shishougang/python_ping">https://github.com/shishougang/python_ping</a>
</p>
</div>
</div>
