src/Python/Python Things.html

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">Lars Strand's ping</h3>
<div class="outline-text-3" id="text-5-4">
<p>
ping.py uses the ICMP protocol's mandatory ECHO<sub>REQUEST</sub> 
datagram to elicit an ICMP ECHO<sub>RESPONSE</sub> from a 
host or gateway.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/usr/bin/env python </span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">-*- coding: iso-8859-1 -*- </span>
<span style="color: #ffa07a;">"""ping.py </span>

<span style="color: #ffa07a;">ping.py uses the ICMP protocol's mandatory ECHO_REQUEST </span>
<span style="color: #ffa07a;">datagram to elicit an ICMP ECHO_RESPONSE from a </span>
<span style="color: #ffa07a;">host or gateway. </span>

<span style="color: #ffa07a;">Copyright (C) 2004 - Lars Strand &lt;lars strand at gnist org&gt; </span>

<span style="color: #ffa07a;">This program is free software; you can redistribute it and/or </span>
<span style="color: #ffa07a;">modify it under the terms of the GNU General Public License </span>
<span style="color: #ffa07a;">as published by the Free Software Foundation; either version 2 </span>
<span style="color: #ffa07a;">of the License, or (at your option) any later version. </span>

<span style="color: #ffa07a;">This program is distributed in the hope that it will be useful, </span>
<span style="color: #ffa07a;">but WITHOUT ANY WARRANTY; without even the implied warranty of </span>
<span style="color: #ffa07a;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the </span>
<span style="color: #ffa07a;">GNU General Public License for more details. </span>

<span style="color: #ffa07a;">You should have received a copy of the GNU General Public License </span>
<span style="color: #ffa07a;">along with this program; if not, write to the Free Software </span>
<span style="color: #ffa07a;">Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA. </span>

<span style="color: #ffa07a;">Must be running as root, or write a suid-wrapper. Since newer *nix </span>
<span style="color: #ffa07a;">variants, the kernel ignores the set[ug]id flags on #! scripts for </span>
<span style="color: #ffa07a;">security reasons </span>

<span style="color: #ffa07a;">RFC792, echo/reply message: </span>

<span style="color: #ffa07a;"> 0                   1                   2                   3 </span>
<span style="color: #ffa07a;"> 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 </span>
<span style="color: #ffa07a;">+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ </span>
<span style="color: #ffa07a;">|     Type      |     Code      |          Checksum             | </span>
<span style="color: #ffa07a;">+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ </span>
<span style="color: #ffa07a;">|           Identifier          |        Sequence Number        | </span>
<span style="color: #ffa07a;">+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ </span>
<span style="color: #ffa07a;">|     Data ... </span>
<span style="color: #ffa07a;">+-+-+-+-+- </span>


<span style="color: #ffa07a;">TODO</span><span style="color: #ffa07a;">: </span>
<span style="color: #ffa07a;">- do not create socket inside 'while' (but if not: ipv6 won't work) </span>
<span style="color: #ffa07a;">- add support for broadcast/multicast </span>
<span style="color: #ffa07a;">- add support for own payload string </span>

<span style="color: #ffa07a;">CHANGELOG: </span>
<span style="color: #ffa07a;">DONE --&gt; bugfix from Filip Van Raemdonck mechanix debian org </span>
<span style="color: #ffa07a;">DONE --&gt; add more support for modules (raise instead of sys.exit) </span>
<span style="color: #ffa07a;">DONE --&gt; locale func names </span>
<span style="color: #ffa07a;">DONE --&gt; package def </span>
<span style="color: #ffa07a;">DONE --&gt; some code cleanup </span>

<span style="color: #ffa07a;">"""</span> 

<span style="color: #00ffff;">import</span> sys 
<span style="color: #00ffff;">import</span> os 
<span style="color: #00ffff;">import</span> struct 
<span style="color: #00ffff;">import</span> array 
<span style="color: #00ffff;">import</span> time 
<span style="color: #00ffff;">import</span> select 
<span style="color: #00ffff;">import</span> binascii 
<span style="color: #00ffff;">import</span> math 
<span style="color: #00ffff;">import</span> getopt 
<span style="color: #00ffff;">import</span> string 
<span style="color: #00ffff;">import</span> socket 

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">total size of data (payload) </span>
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_DATA_STR</span> = 56  

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">initial values of header variables </span>
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_TYPE</span> = 8 
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_TYPE_IP6</span> = 128 
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_CODE</span> = 0 
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_CHECKSUM</span> = 0 
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_ID</span> = 0 
<span style="color: #ffebcd; background-color: #2f4f4f;">ICMP_SEQ_NR</span> = 0 

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Package definitions. </span>
<span style="color: #ffebcd; background-color: #2f4f4f;">__program__</span>   = <span style="color: #ffa07a;">'ping'</span> 
<span style="color: #ffebcd; background-color: #2f4f4f;">__version__</span>   = <span style="color: #ffa07a;">'0.5a'</span> 
<span style="color: #ffebcd; background-color: #2f4f4f;">__date__</span>      = <span style="color: #ffa07a;">'2004/15/12'</span> 
<span style="color: #ffebcd; background-color: #2f4f4f;">__author__</span>    = <span style="color: #ffa07a;">'Lars Strand &lt;lars at unik no&gt;'</span> 
<span style="color: #ffebcd; background-color: #2f4f4f;">__licence__</span>   = <span style="color: #ffa07a;">'GPL'</span> 
<span style="color: #ffebcd; background-color: #2f4f4f;">__copyright__</span> = <span style="color: #ffa07a;">'Copyright (C) 2004 Lars Strand'</span> 

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">_construct</span>(id, size, ipv6): 
   <span style="color: #ffa07a;">"""Constructs a ICMP echo packet of variable size </span>
<span style="color: #ffa07a;">   """</span> 

   <span style="color: #ff7f24;"># size must be big enough to contain time sent </span>
   <span style="color: #00ffff;">if</span> size &lt; <span style="color: #b0c4de;">int</span>(struct.calcsize(<span style="color: #ffa07a;">"d"</span>)): 
       _error(<span style="color: #ffa07a;">"packetsize to small, must be at least %d"</span> % <span style="color: #b0c4de;">int</span>(struct.calcsize(<span style="color: #ffa07a;">"d"</span>))) 

   <span style="color: #ff7f24;"># construct header </span>
   <span style="color: #00ffff;">if</span> ipv6: 
       <span style="color: #ffebcd; background-color: #2f4f4f;">header</span> = struct.pack(<span style="color: #ffa07a;">'BbHHh'</span>, ICMP_TYPE_IP6, ICMP_CODE, ICMP_CHECKSUM,
                            ICMP_ID, ICMP_SEQ_NR+id) 
   <span style="color: #00ffff;">else:</span> 
       <span style="color: #ffebcd; background-color: #2f4f4f;">header</span> = struct.pack(<span style="color: #ffa07a;">'bbHHh'</span>, ICMP_TYPE, ICMP_CODE, ICMP_CHECKSUM,
                            ICMP_ID, ICMP_SEQ_NR+id) 

   <span style="color: #ff7f24;"># if size big enough, embed this payload </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">load</span> = <span style="color: #ffa07a;">"-- IF YOU ARE READING THIS YOU ARE A NERD! --"</span> 

   <span style="color: #ff7f24;"># space for time </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">size</span> -= struct.calcsize(<span style="color: #ffa07a;">"d"</span>) 

   <span style="color: #ff7f24;"># construct payload based on size, may be omitted :) </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">rest</span> = <span style="color: #ffa07a;">""</span> 
   <span style="color: #00ffff;">if</span> size &gt; <span style="color: #b0c4de;">len</span>(load): 
       <span style="color: #ffebcd; background-color: #2f4f4f;">rest</span> = load 
       <span style="color: #ffebcd; background-color: #2f4f4f;">size</span> -= <span style="color: #b0c4de;">len</span>(load) 

   <span style="color: #ff7f24;"># pad the rest of payload </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">rest</span> += size * <span style="color: #ffa07a;">"X"</span> 

   <span style="color: #ff7f24;"># pack </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">data</span> = struct.pack(<span style="color: #ffa07a;">"d"</span>, time.time()) + rest 
   <span style="color: #ffebcd; background-color: #2f4f4f;">packet</span> = header + data          <span style="color: #ff7f24;"># ping packet without checksum </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">checksum</span> = _in_cksum(packet)    <span style="color: #ff7f24;"># make checksum </span>

   <span style="color: #ff7f24;"># construct header with correct checksum </span>
   <span style="color: #00ffff;">if</span> ipv6: 
       <span style="color: #ffebcd; background-color: #2f4f4f;">header</span> = struct.pack(<span style="color: #ffa07a;">'BbHHh'</span>, ICMP_TYPE_IP6, ICMP_CODE, checksum, 
                            ICMP_ID, ICMP_SEQ_NR+id) 
   <span style="color: #00ffff;">else:</span> 
       <span style="color: #ffebcd; background-color: #2f4f4f;">header</span> = struct.pack(<span style="color: #ffa07a;">'bbHHh'</span>, ICMP_TYPE, ICMP_CODE, checksum, ICMP_ID, 
                            ICMP_SEQ_NR+id) 

   <span style="color: #ff7f24;"># ping packet *with* checksum </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">packet</span> = header + data 

   <span style="color: #ff7f24;"># a perfectly formatted ICMP echo packet </span>
   <span style="color: #00ffff;">return</span> packet 

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">_in_cksum</span>(packet): 
   <span style="color: #ffa07a;">"""THE RFC792 states: 'The 16 bit one's complement of </span>
<span style="color: #ffa07a;">   the one's complement sum of all 16 bit words in the header.' </span>

<span style="color: #ffa07a;">   Generates a checksum of a (ICMP) packet. Based on in_chksum found </span>
<span style="color: #ffa07a;">   in ping.c on FreeBSD. </span>
<span style="color: #ffa07a;">   """</span> 

   <span style="color: #ff7f24;"># add byte if not dividable by 2 </span>
   <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">len</span>(packet) &amp; 1:              
       <span style="color: #ffebcd; background-color: #2f4f4f;">packet</span> = packet + <span style="color: #ffa07a;">'\0'</span> 

   <span style="color: #ff7f24;"># split into 16-bit word and insert into a binary array </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">words</span> = array.array(<span style="color: #ffa07a;">'h'</span>, packet) 
   <span style="color: #b0c4de;">sum</span> = 0 

   <span style="color: #ff7f24;"># perform ones complement arithmetic on 16-bit words </span>
   <span style="color: #00ffff;">for</span> word <span style="color: #00ffff;">in</span> words: 
       <span style="color: #b0c4de;">sum</span> += (word &amp; 0xffff) 

   <span style="color: #ffebcd; background-color: #2f4f4f;">hi</span> = <span style="color: #b0c4de;">sum</span> &gt;&gt; 16 
   <span style="color: #ffebcd; background-color: #2f4f4f;">lo</span> = <span style="color: #b0c4de;">sum</span> &amp; 0xffff 
   <span style="color: #b0c4de;">sum</span> = hi + lo 
   <span style="color: #b0c4de;">sum</span> = <span style="color: #b0c4de;">sum</span> + (<span style="color: #b0c4de;">sum</span> &gt;&gt; 16) 

   <span style="color: #00ffff;">return</span> (~sum) &amp; 0xffff <span style="color: #ff7f24;"># return ones complement </span>

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">pingNode</span>(<span style="color: #ffebcd; background-color: #2f4f4f;">alive</span>=0, <span style="color: #ffebcd; background-color: #2f4f4f;">timeout</span>=1.0, <span style="color: #ffebcd; background-color: #2f4f4f;">ipv6</span>=0, <span style="color: #ffebcd; background-color: #2f4f4f;">number</span>=sys.maxint, <span style="color: #ffebcd; background-color: #2f4f4f;">node</span>=<span style="color: #00ffff;">None</span>, 
            <span style="color: #ffebcd; background-color: #2f4f4f;">flood</span>=0, <span style="color: #ffebcd; background-color: #2f4f4f;">size</span>=ICMP_DATA_STR): 
   <span style="color: #ffa07a;">"""Pings a node based on input given to the function. </span>
<span style="color: #ffa07a;">   """</span> 

   <span style="color: #ff7f24;"># if no node, exit </span>
   <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> node: 
       _error(<span style="color: #ffa07a;">""</span>) 

   <span style="color: #ff7f24;"># if not a valid host, exit </span>
   <span style="color: #00ffff;">if</span> ipv6: 
       <span style="color: #00ffff;">if</span> socket.has_ipv6: 
           <span style="color: #00ffff;">try:</span> 
               info, <span style="color: #ffebcd; background-color: #2f4f4f;">port</span> = socket.getaddrinfo(node, <span style="color: #00ffff;">None</span>) 
               <span style="color: #ffebcd; background-color: #2f4f4f;">host</span> = info[4][0] 
               <span style="color: #ff7f24;"># do not print ipv6 twice if ipv6 address given as node </span>
               <span style="color: #00ffff;">if</span> host == node: 
                   <span style="color: #ffebcd; background-color: #2f4f4f;">noPrintIPv6adr</span> = 1 
           <span style="color: #00ffff;">except:</span> 
               _error(<span style="color: #ffa07a;">"cannot resolve %s: Unknow host"</span> % node) 
       <span style="color: #00ffff;">else:</span> 
           _error(<span style="color: #ffa07a;">"No support for IPv6 on this plattform"</span>) 
   <span style="color: #00ffff;">else:</span>    <span style="color: #ff7f24;"># IPv4 </span>
       <span style="color: #00ffff;">try:</span> 
           <span style="color: #ffebcd; background-color: #2f4f4f;">host</span> = socket.gethostbyname(node) 
       <span style="color: #00ffff;">except:</span> 
           _error(<span style="color: #ffa07a;">"cannot resolve %s: Unknow host"</span> % node) 

   <span style="color: #ff7f24;"># trying to ping a network? </span>
   <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> ipv6: 
       <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">int</span>(string.split(host, <span style="color: #ffa07a;">"."</span>)[-1]) == 0: 
           _error(<span style="color: #ffa07a;">"no support for network ping"</span>) 

   <span style="color: #ff7f24;"># do some sanity check </span>
   <span style="color: #00ffff;">if</span> number == 0: 
       _error(<span style="color: #ffa07a;">"invalid count of packets to transmit: '%s'"</span> % <span style="color: #b0c4de;">str</span>(a)) 
   <span style="color: #00ffff;">if</span> alive: 
       <span style="color: #ffebcd; background-color: #2f4f4f;">number</span> = 1 

   <span style="color: #ff7f24;"># Send the ping(s) </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> = 1; <span style="color: #ffebcd; background-color: #2f4f4f;">mint</span> = 999; <span style="color: #ffebcd; background-color: #2f4f4f;">maxt</span> = 0.0; <span style="color: #ffebcd; background-color: #2f4f4f;">avg</span> = 0.0 
   <span style="color: #ffebcd; background-color: #2f4f4f;">lost</span> = 0; <span style="color: #ffebcd; background-color: #2f4f4f;">tsum</span> = 0.0; <span style="color: #ffebcd; background-color: #2f4f4f;">tsumsq</span> = 0.0 

   <span style="color: #ff7f24;"># tell the user what we do </span>
   <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> alive: 
       <span style="color: #00ffff;">if</span> ipv6: 
           <span style="color: #ff7f24;"># do not print the ipv6 twice if ip adress given as node </span>
           <span style="color: #ff7f24;"># (it can be to long in term window) </span>
           <span style="color: #00ffff;">if</span> noPrintIPv6adr == 1: 
               <span style="color: #ff7f24;"># add 40 (header) + 8 (icmp header) + payload </span>
               <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"PING %s : %d data bytes (40+8+%d)"</span> % (<span style="color: #b0c4de;">str</span>(node), 
                                                            40+8+size, size) 
           <span style="color: #00ffff;">else:</span> 
               <span style="color: #ff7f24;"># add 40 (header) + 8 (icmp header) + payload </span>
               <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"PING %s (%s): %d data bytes (40+8+%d)"</span> % (<span style="color: #b0c4de;">str</span>(node), 
                                                                <span style="color: #b0c4de;">str</span>(host), 40+8+size, size) 
       <span style="color: #00ffff;">else:</span> 
           <span style="color: #ff7f24;"># add 20 (header) + 8 (icmp header) + payload </span>
           <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"PING %s (%s): %d data bytes (20+8+%d)"</span> % (<span style="color: #b0c4de;">str</span>(node), <span style="color: #b0c4de;">str</span>(host), 
                                                            20+8+size, size) 

   <span style="color: #ff7f24;"># trap ctrl-d and ctrl-c </span>
   <span style="color: #00ffff;">try:</span> 

       <span style="color: #ff7f24;"># send the number of ping packets as given </span>
       <span style="color: #00ffff;">while</span> start &lt;= number: 
           <span style="color: #ffebcd; background-color: #2f4f4f;">lost</span> += 1 <span style="color: #ff7f24;"># in case user hit ctrl-c </span>

           <span style="color: #ff7f24;"># create the IPv6/IPv4 socket </span>
           <span style="color: #00ffff;">if</span> ipv6: 
               <span style="color: #ff7f24;"># can not create a raw socket if not root or setuid to root </span>
               <span style="color: #00ffff;">try:</span> 
                   <span style="color: #ffebcd; background-color: #2f4f4f;">pingSocket</span> = socket.socket(socket.AF_INET6, socket.SOCK_RAW, 
                                              socket.getprotobyname(<span style="color: #ffa07a;">"ipv6-icmp"</span>)) 
               <span style="color: #00ffff;">except</span> <span style="color: #b0c4de;">socket.error</span>, e: 
                   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"socket error: %s"</span> % e 
                   _error(<span style="color: #ffa07a;">"You must be root (uses raw sockets)"</span> % os.path.basename(sys.argv[0])) 

           <span style="color: #ff7f24;"># IPv4 </span>
           <span style="color: #00ffff;">else:</span> 
               <span style="color: #ff7f24;"># can not create a raw socket if not root or setuid to root </span>
               <span style="color: #00ffff;">try:</span> 
                   <span style="color: #ffebcd; background-color: #2f4f4f;">pingSocket</span> = socket.socket(socket.AF_INET, socket.SOCK_RAW, 
                                              socket.getprotobyname(<span style="color: #ffa07a;">"icmp"</span>)) 
               <span style="color: #00ffff;">except</span> <span style="color: #b0c4de;">socket.error</span>, e: 
                   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"socket error: %s"</span> % e 
                   _error(<span style="color: #ffa07a;">"You must be root (%s uses raw sockets)"</span> % os.path.basename(sys.argv[0])) 

           <span style="color: #ffebcd; background-color: #2f4f4f;">packet</span> = _construct(start, size, ipv6) <span style="color: #ff7f24;"># make a ping packet </span>

           <span style="color: #ff7f24;"># send the ping </span>
           <span style="color: #00ffff;">try:</span> 
               pingSocket.sendto(packet,(node,1)) 
           <span style="color: #00ffff;">except</span> <span style="color: #b0c4de;">socket.error</span>, e: 
               _error(<span style="color: #ffa07a;">"socket error: %s"</span> % e) 

           <span style="color: #ff7f24;"># reset values </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">pong</span> = <span style="color: #ffa07a;">""</span>; <span style="color: #ffebcd; background-color: #2f4f4f;">iwtd</span> = [] 

           <span style="color: #ff7f24;"># wait until there is data in the socket </span>
           <span style="color: #00ffff;">while</span> 1: 
               <span style="color: #ff7f24;"># input, output, exceptional conditions </span>
               iwtd, owtd, <span style="color: #ffebcd; background-color: #2f4f4f;">ewtd</span> = select.select([pingSocket], [], [], timeout) 
               <span style="color: #00ffff;">break</span> <span style="color: #ff7f24;"># no data and timout occurred </span>

           <span style="color: #ff7f24;"># data on socket - this means we have an answer </span>
           <span style="color: #00ffff;">if</span> iwtd:  <span style="color: #ff7f24;"># ok, data on socket </span>
               <span style="color: #ffebcd; background-color: #2f4f4f;">endtime</span> = time.time()  <span style="color: #ff7f24;"># time packet received </span>
               <span style="color: #ff7f24;"># read data (we only need the header) </span>
               pong, <span style="color: #ffebcd; background-color: #2f4f4f;">address</span> = pingSocket.recvfrom(size+48) 
               <span style="color: #ffebcd; background-color: #2f4f4f;">lost</span> -= 1 <span style="color: #ff7f24;"># in case user hit ctrl-c </span>

               <span style="color: #ff7f24;"># examine packet </span>
               <span style="color: #ff7f24;"># fetch TTL from IP header </span>
               <span style="color: #00ffff;">if</span> ipv6: 
                   <span style="color: #ff7f24;"># since IPv6 header and any extension header are never passed </span>
                   <span style="color: #ff7f24;"># to a raw socket, we can *not* get hoplimit field.. </span>
                   <span style="color: #ff7f24;"># I hoped that a socket option would help, but it's not </span>
                   <span style="color: #ff7f24;"># supported: </span>
                   <span style="color: #ff7f24;">#   pingSocket.setsockopt(IPPROTO_IPV6, IPV6_RECVHOPLIMIT, 1) </span>
                   <span style="color: #ff7f24;"># so we can't fetch hoplimit.. </span>

                   <span style="color: #ff7f24;"># fetch hoplimit </span>
                   <span style="color: #ff7f24;">#rawPongHop = struct.unpack("c", pong[7])[0] </span>

                   <span style="color: #ff7f24;"># fetch pong header </span>
                   <span style="color: #ffebcd; background-color: #2f4f4f;">pongHeader</span> = pong[0:8] 
                   pongType, pongCode, pongChksum, pongID, <span style="color: #ffebcd; background-color: #2f4f4f;">pongSeqnr</span> = \
                             struct.unpack(<span style="color: #ffa07a;">"bbHHh"</span>, pongHeader) 

                   <span style="color: #ff7f24;"># fetch starttime from pong </span>
                   <span style="color: #ffebcd; background-color: #2f4f4f;">starttime</span> = struct.unpack(<span style="color: #ffa07a;">"d"</span>, pong[8:16])[0] 

               <span style="color: #ff7f24;"># IPv4 </span>
               <span style="color: #00ffff;">else:</span> 
                   <span style="color: #ff7f24;"># time to live </span>
                   <span style="color: #ffebcd; background-color: #2f4f4f;">rawPongHop</span> = struct.unpack(<span style="color: #ffa07a;">"s"</span>, pong[8])[0] 

                   <span style="color: #ff7f24;"># convert TTL from 8 bit to 16 bit integer </span>
                   <span style="color: #ffebcd; background-color: #2f4f4f;">pongHop</span> = <span style="color: #b0c4de;">int</span>(binascii.hexlify(<span style="color: #b0c4de;">str</span>(rawPongHop)), 16) 

                   <span style="color: #ff7f24;"># fetch pong header </span>
                   <span style="color: #ffebcd; background-color: #2f4f4f;">pongHeader</span> = pong[20:28] 
                   pongType, pongCode, pongChksum, pongID, <span style="color: #ffebcd; background-color: #2f4f4f;">pongSeqnr</span> = \
                             struct.unpack(<span style="color: #ffa07a;">"bbHHh"</span>, pongHeader) 

                   <span style="color: #ff7f24;"># fetch starttime from pong </span>
                   <span style="color: #ffebcd; background-color: #2f4f4f;">starttime</span> = struct.unpack(<span style="color: #ffa07a;">"d"</span>, pong[28:36])[0] 

               <span style="color: #ff7f24;"># valid ping packet received? </span>
               <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> pongSeqnr == start: 
                   <span style="color: #ffebcd; background-color: #2f4f4f;">pong</span> = <span style="color: #00ffff;">None</span> 

           <span style="color: #ff7f24;"># NO data on socket - timeout waiting for answer </span>
           <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> pong: 
               <span style="color: #00ffff;">if</span> alive: 
                   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"no reply from %s (%s)"</span> % (<span style="color: #b0c4de;">str</span>(node), <span style="color: #b0c4de;">str</span>(host)) 
               <span style="color: #00ffff;">else:</span> 
                   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"ping timeout: %s (icmp_seq=%d) "</span> % (host, start) 

               <span style="color: #ff7f24;"># do not wait if just sending one packet </span>
               <span style="color: #00ffff;">if</span> number != 1 <span style="color: #00ffff;">and</span> start &lt; number: 
                   time.sleep(flood ^ 1) 
               <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> += 1 
               <span style="color: #00ffff;">continue</span>  <span style="color: #ff7f24;"># lost a packet - try again </span>

           <span style="color: #ffebcd; background-color: #2f4f4f;">triptime</span>  = endtime - starttime <span style="color: #ff7f24;"># compute RRT </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">tsum</span>     += triptime            <span style="color: #ff7f24;"># triptime for all packets (stddev) </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">tsumsq</span>   += triptime * triptime <span style="color: #ff7f24;"># triptime^2  for all packets (stddev) </span>

           <span style="color: #ff7f24;"># compute statistic </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">maxt</span> = <span style="color: #b0c4de;">max</span> ((triptime, maxt)) 
           <span style="color: #ffebcd; background-color: #2f4f4f;">mint</span> = <span style="color: #b0c4de;">min</span> ((triptime, mint)) 

           <span style="color: #00ffff;">if</span> alive: 
               <span style="color: #b0c4de;">print</span> str(node) + <span style="color: #ffa07a;">" ("</span> + <span style="color: #b0c4de;">str</span>(host) +<span style="color: #ffa07a;">") is alive"</span> 
           <span style="color: #00ffff;">else:</span> 
               <span style="color: #00ffff;">if</span> ipv6: 
                   <span style="color: #ff7f24;"># size + 8 = payload + header </span>
                   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"%d bytes from %s: icmp_seq=%d time=%.5f ms"</span> % \
                         (size+8, host, pongSeqnr, triptime*1000) 
               <span style="color: #00ffff;">else:</span> 
                   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"%d bytes from %s: icmp_seq=%d ttl=%s time=%.5f ms"</span> % \
                         (size+8, host, pongSeqnr, pongHop, triptime*1000) 

           <span style="color: #ff7f24;"># do not wait if just sending one packet </span>
           <span style="color: #00ffff;">if</span> number != 1 <span style="color: #00ffff;">and</span> start &lt; number: 
               <span style="color: #ff7f24;"># if flood = 1; do not sleep - just ping                </span>
               time.sleep(flood ^ 1) <span style="color: #ff7f24;"># wait before send new packet </span>

           <span style="color: #ff7f24;"># the last thing to do is update the counter - else the value </span>
           <span style="color: #ff7f24;"># (can) get wrong when computing summary at the end (if user </span>
           <span style="color: #ff7f24;"># hit ctrl-c when pinging) </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> += 1 
           <span style="color: #ff7f24;"># end ping send/recv while </span>

   <span style="color: #ff7f24;"># if user ctrl-d or ctrl-c </span>
   <span style="color: #00ffff;">except</span> (<span style="color: #b0c4de;">EOFError</span>, <span style="color: #b0c4de;">KeyboardInterrupt</span>): 
       <span style="color: #ff7f24;"># if user disrupts ping, it is most likly done before </span>
       <span style="color: #ff7f24;"># the counter get updates - if do not update it here, the </span>
       <span style="color: #ff7f24;"># summary get all wrong. </span>
       <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> += 1 
       <span style="color: #00ffff;">pass</span> 

   <span style="color: #ff7f24;"># compute and print som stats </span>
   <span style="color: #ff7f24;"># stddev computation based on ping.c from FreeBSD </span>
   <span style="color: #00ffff;">if</span> start != 0 <span style="color: #00ffff;">or</span> lost &gt; 0:  <span style="color: #ff7f24;"># do not print stats if 0 packet sent </span>
       <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> -= 1              <span style="color: #ff7f24;"># since while is '&lt;=' </span>
       <span style="color: #ffebcd; background-color: #2f4f4f;">avg</span> = tsum / start      <span style="color: #ff7f24;"># avg round trip </span>
       <span style="color: #ffebcd; background-color: #2f4f4f;">vari</span> = tsumsq / start - avg * avg 
       <span style="color: #ff7f24;"># %-packet lost </span>
       <span style="color: #00ffff;">if</span> start == lost: 
           <span style="color: #ffebcd; background-color: #2f4f4f;">plost</span> = 100 
       <span style="color: #00ffff;">else:</span> 
           <span style="color: #ffebcd; background-color: #2f4f4f;">plost</span> = (lost/start)*100 

       <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> alive: 
           <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"\n--- %s ping statistics ---"</span> % node 
           <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"%d packets transmitted, %d packets received, %d%% packet loss"</span> % \
                 (start, start-lost, plost) 
           <span style="color: #ff7f24;"># don't display summary if 100% packet-loss </span>
           <span style="color: #00ffff;">if</span> plost != 100: 
               <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"round-trip min/avg/max/stddev = %.3f/%.3f/%.3f/%.3f ms"</span> % \
                     (mint*1000, (tsum/start)*1000, maxt*1000, math.sqrt(vari)*1000) 

   pingSocket.close() 

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">_error</span>(err): 
   <span style="color: #ffa07a;">"""Exit if running standalone, else raise an exception </span>
<span style="color: #ffa07a;">   """</span> 

   <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">'__main__'</span>: 
       <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"%s: %s"</span> % (os.path.basename(sys.argv[0]), <span style="color: #b0c4de;">str</span>(err)) 
       <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"Try `%s --help' for more information."</span> % os.path.basename(sys.argv[0]) 
       sys.exit(1) 
   <span style="color: #00ffff;">else:</span> 
       <span style="color: #00ffff;">raise</span> <span style="color: #b0c4de;">Exception</span>, <span style="color: #b0c4de;">str</span>(err) 

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">_usage</span>(): 
   <span style="color: #ffa07a;">"""Print usage if run as a standalone program </span>
<span style="color: #ffa07a;">   """</span> 
   <span style="color: #b0c4de;">print</span> <span style="color: #ffa07a;">"""usage: %s [OPTIONS] HOST </span>
<span style="color: #ffa07a;">Send ICMP ECHO_REQUEST packets to network hosts. </span>

<span style="color: #ffa07a;">Mandatory arguments to long options are mandatory for short options too. </span>
<span style="color: #ffa07a;"> -c, --count=N    Stop after sending (and receiving) 'N' ECHO_RESPONSE </span>
<span style="color: #ffa07a;">                  packets. </span>
<span style="color: #ffa07a;"> -s, --size=S     Specify the number of data bytes to be sent. The default </span>
<span style="color: #ffa07a;">                  is 56, which translates into 64 ICMP data bytes when </span>
<span style="color: #ffa07a;">                  combined with the 8 bytes of ICMP header data. </span>
<span style="color: #ffa07a;"> -f, --flood      Flood ping. Outputs packets as fast as they come back. Use </span>
<span style="color: #ffa07a;">                  with caution! </span>
<span style="color: #ffa07a;"> -6, --ipv6       Ping using IPv6. </span>
<span style="color: #ffa07a;"> -t, --timeout=s  Specify a timeout, in seconds, before a ping packet is </span>
<span style="color: #ffa07a;">                  considered 'lost'. </span>
<span style="color: #ffa07a;"> -h, --help       Display this help and exit </span>

<span style="color: #ffa07a;">Report bugs to lars [at] gnist org"""</span> % os.path.basename(sys.argv[0]) 


<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">'__main__'</span>: 
   <span style="color: #ffa07a;">"""Main loop </span>
<span style="color: #ffa07a;">   """</span> 

   <span style="color: #ff7f24;"># version control </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">version</span> = string.split(string.split(sys.version)[0][:3], <span style="color: #ffa07a;">"."</span>) 
   <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">map</span>(int, version) &lt; [2, 3]: 
       _error(<span style="color: #ffa07a;">"You need Python ver 2.3 or higher to run!"</span>) 

   <span style="color: #00ffff;">try:</span> 
       <span style="color: #ff7f24;"># opts = arguments recognized, </span>
       <span style="color: #ff7f24;"># args = arguments NOT recognized (leftovers) </span>
       opts, <span style="color: #ffebcd; background-color: #2f4f4f;">args</span> = getopt.getopt(sys.argv[1:-1], <span style="color: #ffa07a;">"hat:6c:fs:"</span>, 
                                  [<span style="color: #ffa07a;">"help"</span>, <span style="color: #ffa07a;">"alive"</span>, <span style="color: #ffa07a;">"timeout="</span>, <span style="color: #ffa07a;">"ipv6"</span>, 
                                   <span style="color: #ffa07a;">"count="</span>, <span style="color: #ffa07a;">"flood"</span>, <span style="color: #ffa07a;">"packetsize="</span>]) 
   <span style="color: #00ffff;">except</span> <span style="color: #b0c4de;">getopt.GetoptError</span>: 
       <span style="color: #ff7f24;"># print help information and exit: </span>
       _error(<span style="color: #ffa07a;">"illegal option(s) -- "</span> + <span style="color: #b0c4de;">str</span>(sys.argv[1:])) 

   <span style="color: #ff7f24;"># test whether any host given </span>
   <span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">len</span>(sys.argv) &gt;= 2: 
       <span style="color: #ffebcd; background-color: #2f4f4f;">node</span> = sys.argv[-1:][0]   <span style="color: #ff7f24;"># host to be pinged </span>
       <span style="color: #00ffff;">if</span> node[0] == <span style="color: #ffa07a;">'-'</span> <span style="color: #00ffff;">or</span> node == <span style="color: #ffa07a;">'-h'</span> <span style="color: #00ffff;">or</span> node == <span style="color: #ffa07a;">'--help'</span> :  
           _usage() 
   <span style="color: #00ffff;">else:</span> 
       _error(<span style="color: #ffa07a;">"No arguments given"</span>) 

   <span style="color: #00ffff;">if</span> args: 
       _error(<span style="color: #ffa07a;">"illegal option -- %s"</span> % <span style="color: #b0c4de;">str</span>(args)) 

   <span style="color: #ff7f24;"># default variables </span>
   <span style="color: #ffebcd; background-color: #2f4f4f;">alive</span> = 0; <span style="color: #ffebcd; background-color: #2f4f4f;">timeout</span> = 1.0; <span style="color: #ffebcd; background-color: #2f4f4f;">ipv6</span> = 0; <span style="color: #ffebcd; background-color: #2f4f4f;">count</span> = sys.maxint; 
   <span style="color: #ffebcd; background-color: #2f4f4f;">flood</span> = 0; <span style="color: #ffebcd; background-color: #2f4f4f;">size</span> = ICMP_DATA_STR 

   <span style="color: #ff7f24;"># run through arguments and set variables </span>
   <span style="color: #00ffff;">for</span> o, a <span style="color: #00ffff;">in</span> opts: 
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-h"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--help"</span>:    <span style="color: #ff7f24;"># display help and exit </span>
           _usage() 
           sys.exit(0) 
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-t"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--timeout"</span>: <span style="color: #ff7f24;"># timeout before "lost" </span>
           <span style="color: #00ffff;">try:</span> 
               <span style="color: #ffebcd; background-color: #2f4f4f;">timeout</span> = <span style="color: #b0c4de;">float</span>(a) 
           <span style="color: #00ffff;">except:</span> 
               _error(<span style="color: #ffa07a;">"invalid timout: '%s'"</span> % <span style="color: #b0c4de;">str</span>(a)) 
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-6"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--ipv6"</span>:    <span style="color: #ff7f24;"># ping ipv6 </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">ipv6</span> = 1 
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-c"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--count"</span>:   <span style="color: #ff7f24;"># how many pings? </span>
           <span style="color: #00ffff;">try:</span> 
               <span style="color: #ffebcd; background-color: #2f4f4f;">count</span> = <span style="color: #b0c4de;">int</span>(a) 
           <span style="color: #00ffff;">except:</span> 
               _error(<span style="color: #ffa07a;">"invalid count of packets to transmit: '%s'"</span> % <span style="color: #b0c4de;">str</span>(a)) 
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-f"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--flood"</span>:   <span style="color: #ff7f24;"># no delay between ping send </span>
           <span style="color: #ffebcd; background-color: #2f4f4f;">flood</span> = 1 
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-s"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--packetsize"</span>:  <span style="color: #ff7f24;"># set the ping payload size </span>
           <span style="color: #00ffff;">try:</span> 
               <span style="color: #ffebcd; background-color: #2f4f4f;">size</span> = <span style="color: #b0c4de;">int</span>(a) 
           <span style="color: #00ffff;">except:</span> 
               _error(<span style="color: #ffa07a;">"invalid packet size: '%s'"</span> % <span style="color: #b0c4de;">str</span>(a)) 
       <span style="color: #ff7f24;"># just send one packet and say "it's alive" </span>
       <span style="color: #00ffff;">if</span> o == <span style="color: #ffa07a;">"-a"</span> <span style="color: #00ffff;">or</span> o == <span style="color: #ffa07a;">"--alive"</span>:  
           <span style="color: #ffebcd; background-color: #2f4f4f;">alive</span> = 1 

   <span style="color: #ff7f24;"># here we send </span>
   pingNode(<span style="color: #ffebcd; background-color: #2f4f4f;">alive</span>=alive, <span style="color: #ffebcd; background-color: #2f4f4f;">timeout</span>=timeout, <span style="color: #ffebcd; background-color: #2f4f4f;">ipv6</span>=ipv6, <span style="color: #ffebcd; background-color: #2f4f4f;">number</span>=count, 
            <span style="color: #ffebcd; background-color: #2f4f4f;">node</span>=node, <span style="color: #ffebcd; background-color: #2f4f4f;">flood</span>=flood, <span style="color: #ffebcd; background-color: #2f4f4f;">size</span>=size) 
   <span style="color: #ff7f24;"># if we made it this far, do a clean exit </span>
   sys.exit(0) 

<span style="color: #ff7f24;">### </span><span style="color: #ff7f24;">end</span>
</pre>
</div>
</div>
</div>
</div>
