src/Python/Python Things.org
* Python "pseudo-inplace" file contents

#+begin_src python 
  import fileinput
  for line in file.input('name.txt', inplace=1):
      print line
      if line.startswith('something'):
          pirnt 'xxx'  #insert
#+end_src
* Python send simple Email
#+begin_src python
import smtplib

def sendEmail(to):
    fromaddr = 'xx@gmail.com'
    toaddrs  = to #['xxx', 'xxx']
    msg = 'test'
    
    username = ''
    password = ''
    
    server = smtplib.SMTP('smtp.gmail.com', 587)
    server.ehlo()
    server.starttls()
    server.login(username, password)
    server.sendmail(fromaddr, toaddrs, msg)
    server.quit()
#+end_src
* compare "version-style" strings
+ use =distutils.version=
  #+begin_src python
    >>> from distutils.version import LooseVersion, StrictVersion
    >>> LooseVersion("2.3.1") < LooseVersion("10.1.2")
    True
    >>> StrictVersion("2.3.1") < StrictVersion("10.1.2")
    True
  #+end_src
+ use =tuple=
  #+begin_src python
    def versiontuple(v):
        return tuple(map(int, (v.split("."))))
    
    >>> versiontuple("2.3.1") > versiontuple("10.1.1")
    False
  #+end_src
+ use =re=
  #+begin_src python
    import re
    
    def mycmp(version1, version2):
        def normalize(v):
            return [int(x) for x in re.sub(r'(\.0+)*$','', v).split(".")]
        return cmp(normalize(version1), normalize(version2))
  #+end_src
* windows install pip
1) Install Setup tools.
  http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools
2) Install PIP
  http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools

3) Add Python Scripts to the path Start -> Edit environment variables
   eg. C:\Python27\Scripts

