src/Python/Python Things.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Python "pseudo-inplace" file contents</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">import</span> fileinput
<span style="color: #00ffff;">for</span> line <span style="color: #00ffff;">in</span> file.input(<span style="color: #ffa07a;">'name.txt'</span>, <span style="color: #ffebcd; background-color: #2f4f4f;">inplace</span>=1):
    <span style="color: #b0c4de;">print</span> line
    <span style="color: #00ffff;">if</span> line.startswith(<span style="color: #ffa07a;">'something'</span>):
        pirnt <span style="color: #ffa07a;">'xxx'</span>  <span style="color: #ff7f24;">#insert</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Python send simple Email</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">import</span> smtplib

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">sendEmail</span>(to):
    <span style="color: #ffebcd; background-color: #2f4f4f;">fromaddr</span> = <span style="color: #ffa07a;">'xx@gmail.com'</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">toaddrs</span>  = to <span style="color: #ff7f24;">#['xxx', 'xxx']</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">msg</span> = <span style="color: #ffa07a;">'test'</span>

    <span style="color: #ffebcd; background-color: #2f4f4f;">username</span> = <span style="color: #ffa07a;">''</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">password</span> = <span style="color: #ffa07a;">''</span>

    <span style="color: #ffebcd; background-color: #2f4f4f;">server</span> = smtplib.SMTP(<span style="color: #ffa07a;">'smtp.gmail.com'</span>, 587)
    server.ehlo()
    server.starttls()
    server.login(username, password)
    server.sendmail(fromaddr, toaddrs, msg)
    server.quit()
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">compare "version-style" strings</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>use <code>distutils.version</code>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #00ffff;">from</span> distutils.version <span style="color: #00ffff;">import</span> LooseVersion, StrictVersion
&gt;&gt;&gt; LooseVersion(<span style="color: #ffa07a;">"2.3.1"</span>) &lt; LooseVersion(<span style="color: #ffa07a;">"10.1.2"</span>)
<span style="color: #00ffff;">True</span>
&gt;&gt;&gt; StrictVersion(<span style="color: #ffa07a;">"2.3.1"</span>) &lt; StrictVersion(<span style="color: #ffa07a;">"10.1.2"</span>)
<span style="color: #00ffff;">True</span>
</pre>
</div>
</li>
<li>use <code>tuple</code>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">versiontuple</span>(v):
    <span style="color: #00ffff;">return</span> <span style="color: #b0c4de;">tuple</span>(map(int, (v.split(<span style="color: #ffa07a;">"."</span>))))

&gt;&gt;&gt; versiontuple(<span style="color: #ffa07a;">"2.3.1"</span>) &gt; versiontuple(<span style="color: #ffa07a;">"10.1.1"</span>)
<span style="color: #00ffff;">False</span>
</pre>
</div>
</li>
<li>use <code>re</code>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #00ffff;">import</span> re

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">mycmp</span>(version1, version2):
    <span style="color: #00ffff;">def</span> <span style="color: #87cefa;">normalize</span>(v):
        <span style="color: #00ffff;">return</span> [<span style="color: #b0c4de;">int</span>(x) <span style="color: #00ffff;">for</span> x <span style="color: #00ffff;">in</span> re.sub(r<span style="color: #ffa07a;">'(\.0+)*$'</span>,<span style="color: #ffa07a;">''</span>, v).split(<span style="color: #ffa07a;">"."</span>)]
    <span style="color: #00ffff;">return</span> <span style="color: #b0c4de;">cmp</span>(normalize(version1), normalize(version2))
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">windows install pip</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>Install Setup tools.
  <a href="http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools">http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools</a>
</li>
<li>Install PIP
  <a href="http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools">http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools</a>
</li>

<li>Add Python Scripts to the path Start -&gt; Edit environment variables
eg. C:\Python27\Scripts
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-01-01 Wed 16:09</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
